#include <bits/stdc++.h>

#define mod 998244353

using namespace std;

int T;
int a,b,c,d;

int main() {
    scanf("%d",&T);
    while (T--) {
        scanf("%d %d %d %d",&a,&b,&c,&d);
    }
}

/*
1 2 -> 4
1 3 -> 1
2 1 -> 3
2 4 -> 2
3 2 -> 2
3 3 -> 3
4 1 -> 1
4 4 -> 4

3 - 4 不能连一起
任何一个块和 3 或 4 连一起，得到的新的块还是本身
1 2 -> 4
2 1 -> 3

1 3,4 -> 1
2 3,4 -> 2
3 3 -> 3
2 1 -> 3
4 4 -> 4
1 2 -> 4

1 2 3 4
0 0 - 0 -> 3 (1. 1 3    2. 2 3    3. 3 3)
0 0 0 - -> 3 (1. 1 4    2. 2 4    3. 4 4)
- - + 0 -> 1
- - 0 + -> 1
*/